---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.IlluminationFailures
source: html/141e5475-8217-394c-c726-9403ae57042e.htm
---
# BuiltInFailures.IlluminationFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.